<template>
  <div class="agreement">
    <h1 class="agreement__title">Пользовательское соглашение</h1>
    <div class="agreement__body">
      <p>
        Настоящее пользовательское соглашение (далее — Соглашение) определяет порядок и условия использования материалов
        и сервисов, размещённых в сети Интернет по адресу
        <strong>https://chloe-dankina.ru</strong> (далее — Сайт). Использование Сайта означает безоговорочное принятие и
        обязанность соблюдать все условия настоящего Соглашения.
      </p>

      <h2 class="agreement__sub-title">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
      <p>
        1.1. В настоящем Соглашении, если из текста прямо не вытекает иное, следующие термины будут иметь указанные ниже
        значения:
      </p>
      <p>
        <strong>Администратор</strong> —
        <strong>ИП Данькина Анастасия Сергеевна ИНН: 891001018354 ОГРН: 321547600190647</strong>, которому принадлежат
        все соответствующие имущественные права на Сайт.
      </p>
      <p><strong>Пользователь</strong> — любое лицо, осуществляющее доступ к Сайту и использующее его материалы.</p>
      <p>
        <strong>Контент</strong> — любое информационно значимое наполнение Сайта, включая, но не ограничиваясь, тексты,
        фотографии, изображения, дизайн, графические элементы.
      </p>
      <p>
        <strong>Сайт</strong> — информационный ресурс в сети Интернет, доступный по адресу
        <strong>https://chloe-dankina.ru</strong>.
      </p>
      <p>1.2. Все остальные термины толкуются в соответствии с действующим законодательством Российской Федерации.</p>

      <h2 class="agreement__sub-title">2. ПРЕДМЕТ СОГЛАШЕНИЯ. ИНФОРМАЦИОННЫЙ ХАРАКТЕР САЙТА</h2>
      <p>
        2.1. Администратор предоставляет Пользователю право безвозмездного ознакомления с материалами Сайта в личных
        некоммерческих целях.
      </p>
      <p>
        2.2. Сайт носит исключительно информационно-справочный характер. Вся представленная на Сайте информация об
        услугах косметологии, включая описания, цены, фотографии, носит ознакомительный характер и не является публичной
        офертой, определённой ст. 437 Гражданского кодекса РФ. Сайт не является медицинским ресурсом и не заменяет очной
        консультации со специалистом. Администратор не оказывает медицинские или иные услуги через Сайт.
      </p>
      <p>
        2.3. Пользователь считается присоединившимся к настоящему Соглашению с момента начала использования Сайта
        (просмотра материалов).
      </p>
      <p>
        2.4. Используя Сайт, Пользователь подтверждает, что ознакомился с условиями Соглашения, принимает их в полном
        объёме и обязуется соблюдать.
      </p>

      <h2 class="agreement__sub-title">3. ПРАВА И ОБЯЗАННОСТИ АДМИНИСТРАТОРА</h2>
      <p>
        3.1. Администратор вправе в любое время изменять Контент Сайта, его дизайн, функционал без предварительного
        уведомления Пользователя.
      </p>
      <p>
        3.2. Администратор вправе приостановить или ограничить доступ к Сайту для проведения технических,
        профилактических или иных работ.
      </p>
      <p>
        3.3. Администратор предпринимает разумные меры для обеспечения доступности и актуальности информации на Сайте,
        но не гарантирует отсутствия ошибок, сбоев, непрерывной работы, а также соответствия Сайта целям и ожиданиям
        Пользователя.
      </p>

      <h2 class="agreement__sub-title">4. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЯ</h2>
      <p>
        4.1. Пользователь обязуется использовать Сайт и его Контент только в законных целях, не нарушая права и законные
        интересы третьих лиц и Администратора.
      </p>
      <p>4.2. Пользователю запрещается:</p>
      <ul class="agreement__list">
        <li type="disc">
          Копировать, воспроизводить, распространять, публиковать или иным образом использовать Контент Сайта в
          коммерческих целях без письменного согласия Администратора.
        </li>
        <li type="disc">
          Использовать автоматизированные скрипты (программы) для сбора информации с Сайта или для взаимодействия с ним.
        </li>
        <li type="disc">
          Совершать действия, направленные на нарушение нормальной работы Сайта или его технических систем.
        </li>
      </ul>
      <p>4.3. При цитировании материалов Сайта ссылка на источник (Сайт) обязательна.</p>

      <h2 class="agreement__sub-title">5. ИСПОЛЬЗОВАНИЕ СТОРОННИХ СЕРВИСОВ И ТЕХНОЛОГИЙ (COOKIES)</h2>
      <p>
        5.1. Для анализа посещаемости, улучшения работы Сайта и персонализации контента Администратор использует
        технологии cookies и аналогичные. Продолжая использовать Сайт, Пользователь соглашается с использованием этих
        технологий.
      </p>
      <p>
        5.2. На Сайте могут быть использованы сервисы сторонних организаций (например, системы веб-аналитики
        Яндекс.Метрика, картографические сервисы Яндекс.Карты). Эти сервисы могут собирать и обрабатывать информацию о
        Пользователе в соответствии со своими политиками конфиденциальности. Администратор не несёт ответственности за
        действия таких третьих лиц.
      </p>

      <h2 class="agreement__sub-title">6. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ</h2>
      <p>6.1. Администратор не несёт ответственности за:</p>
      <ul class="agreement__list">
        <li type="disc">
          Любые убытки, прямые или косвенные, возникшие у Пользователя в связи с использованием или невозможностью
          использования Сайта.
        </li>
        <li type="disc">
          Актуальность, точность и полноту информации, представленной на Сайте, включая, но не ограничиваясь, цены на
          услуги.
        </li>
        <li type="disc">
          Администратор не гарантирует, что цены, указанные на Сайте, полностью соответствуют ценам, действующим в
          момент обращения Пользователя в соответствующую организацию. Актуальные цены уточняйте непосредственно у
          исполнителя услуг.
        </li>
        <li type="disc">Содержание и функционирование внешних сайтов, ссылки на которые могут размещаться на Сайте.</li>
        <li type="disc">Действия Пользователя, совершённые на основе информации, полученной на Сайте.</li>
      </ul>

      <h2 class="agreement__sub-title">7. ПЕРСОНАЛЬНЫЕ ДАННЫЕ</h2>
      <p>
        7.1. Обработка персональных данных Пользователей осуществляется Администратором в строгом соответствии с
        Федеральным законом № 152-ФЗ «О персональных данных».
      </p>
      <p>
        7.2. Политика Администратора в отношении обработки персональных данных изложена в отдельном документе —
        «Политика обработки персональных данных», размещённой по постоянному адресу:
        <router-link to="/privacy-policy"><strong>https://chloe-dankina.ru/privacy-policy</strong></router-link
        >.
      </p>

      <h2 class="agreement__sub-title">8. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
      <p>
        8.1. Настоящее Соглашение может быть изменено Администратором в одностороннем порядке путём размещения
        обновлённого текста на Сайте. Продолжение использования Сайта после внесения изменений означает согласие
        Пользователя с новыми условиями.
      </p>
      <p>8.2. Все споры по Соглашению подлежат разрешению в соответствии с законодательством Российской Федерации.</p>
      <p>
        8.3. В случае признания недействительным какого-либо положения Соглашения, это не влечёт недействительности
        остальных положений.
      </p>

      <h2 class="agreement__sub-title">9. РЕКВИЗИТЫ АДМИНИСТРАТОРА</h2>
      <p>
        <strong>ИП Данькина Анастасия Сергеевна</strong>
      </p>
      <p>ОГРН 321547600190647</p>
      <p>ИНН 891001018354</p>
      <p>Контактный e-mail: info@chloe-dankina.ru</p>
    </div>
  </div>
</template>

<style lang="scss" scoped>
@import '@/assets/style/mixins.scss';

.agreement {
  margin: 0 auto;
  max-width: 950px;
  padding: 0 16px;
  margin-bottom: 5rem;

  &__title {
    margin-top: 3rem;
    font-size: 24px;
    margin-bottom: 1.5rem;
  }

  &__sub-title {
    font-size: 20px;
    margin-top: 3rem;
    margin-bottom: 1.5rem;
  }

  &__list {
    padding: 0 0 0 20px;
    margin-bottom: 24px;

    li {
      margin: 10px 0;
    }
  }
}

p:has(+ ul) {
  margin-bottom: 0;
}
</style>
